2.2.013/src/Catalogs/МК_ДокументыКЭДО/МК_ДокументыКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ДокументыКЭДО</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаДокумента</name>
    <comment>Код типа документа справочника в МояКоманда</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСсылка</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПодписания</name>
    <type>
      <types>EnumRef.МК_МаршрутыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.МК_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученИзМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительФЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЭЦП</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МЧД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьПодписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоФайлаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СотрудникиДокумента</name>
    <attributes>
      <name>СотрудникСсылка</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/InformationRegisters/МК_СостояниеДокументовКЭДО/МК_СостояниеДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МК_СостояниеДокументовКЭДО</name>
  <comment>Регистр содержит ссылку на действующщую запись справочника Документы КЭДО</comment>
  <attributes>
    <name>СсылкаНаПриказ</name>
    <type>
      <types>CatalogRef.МК_ДокументыКЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДоговор</name>
    <type>
      <types>CatalogRef.МК_ДокументыКЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПриказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтатуса1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтатуса2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/Enums/МК_СтатусыДокументов/МК_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыДокументов</name>
  <enumValues>
    <name>С1</name>
  </enumValues>
  <enumValues>
    <name>С2</name>
  </enumValues>
  <enumValues>
    <name>С3</name>
  </enumValues>
  <enumValues>
    <name>С4</name>
  </enumValues>
  <enumValues>
    <name>С5</name>
  </enumValues>
  <enumValues>
    <name>С6</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Enums/МК_СтатусыПодписанияДокументов/МК_СтатусыПодписанияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыПодписанияДокументов</name>
  <enumValues>
    <name>НаПодписании</name>
  </enumValues>
  <enumValues>
    <name>ВОжидании</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_ДокументыКЭДО/ManagerModule.bsl
#Если Не ВнешнееСоединение Тогда   
	                                                       
&НаСервере
Функция ПолучитьИОбработатьДокументыИзМК()    Экспорт   
	мСписокНезавершенных = ПолучитьСписокНезавершенных();
	мЗапрос = ЗапросДокументовИзМК(мСписокНезавершенных,1);
	Если мЗапрос.Результат Тогда 
		мСписок = мЗапрос.СписокДокументов;
		мколвоСтр = мЗапрос.Страницы.totalPages; 	 
		мИндекс = 0;
		//мСписокКОтправке = Новый Массив;          
		мСписокКОтправке = Новый Соответствие;
		мСписокСсылок = Новый Массив;
		Пока мИндекс < мКолвоСтр Цикл
			Если мИндекс > 0 Тогда
				мЗапрос = ЗапросДокументовИзМК(мСписокНезавершенных,мИндекс+1);     
				мСписок = мЗапрос.СписокДокументов;
			КонецЕсли;	
			Для Каждого мЭлемент Из мСписок Цикл
				// Первая задача - разобрать мЭлемент по реквизитам, каждый - определить в 1С и если все хорошо, записать событие в 
				// справочник МК_ДокументыКЭДО
				мРез = РазобратьДокумент(мЭлемент); 
				Если Не (мРез = Неопределено) И Не мРез.Ссылка = Неопределено Тогда  
					мСписокСсылок.Добавить(мРез.Ссылка);				
					Если мРез.Новый Тогда
						мСписокКОтправке.Вставить(Строка(мРез.КодМК),СокрЛП(мРез.Ссылка.УникальныйИдентификатор()));
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	  
			мИндекс = мИндекс + 1;
		КонецЦикла;
		Если мСписокКОтправке.Количество() > 0 Тогда
			ОтправитьСписокДокументов(мСписокКОтправке);
			//ОтразитьВРегистре(мСписокСсылок);
		КонецЕсли;	 
	КонецЕсли;
	Возврат мЗапрос;
КонецФункции

&НаСервере
Функция ЗапросДокументовИзМК(мСписокНезавершенных, мСтраница)                   
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мВозврат = Новый Структура("Результат,СписокДокументов,Страницы,ТекстОшибки",Ложь);   
	мТело = Новый Структура;       	
	мТело.Вставить("Ids",мСписокНезавершенных);
	мТело.Вставить("page", мСтраница);
	//мТело.Вставить("perPage", 4);
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мТело);	
		ТекстJSON = ЗаписьJSON.Закрыть();  
		
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/documents-list", мСеанс);    		
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная    
				мОшибка = "Неверная структура ответа от МК";
			Иначе     	
				Если СтрОтвет.data.status = "success" Тогда 
					мВозврат.Результат = Истина;                    
					мВозврат.СписокДокументов = СтрОтвет.Data.Items;	
					мВозврат.Страницы = СтрОтвет.Data.pagination;       		                
				Иначе                                                
					мОшибка = "";
					Для Каждого тОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + тОшибка;
					КонецЦикла;	                                 
					мВозврат.ТекстОшибки = мОшибка;
				КонецЕсли;	 		
			КонецЕсли;				
		Исключение   
			мОшибка = "Ошибка получения документов. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции   

Функция РазобратьДокумент(мЭлемент) 
	// Что должно быть в документе.
	// document_id        + - Код документа из МК   
	// ext_id             + - Идентификатор ссылки в 1С   
	// name               + - Название документа
    // number             + - Номер документа   
	// type_id            + - Идентификатор типа документа
    // status             + - Статус подписания
    // division_id        + - Идентификатор организации/юрлица
    // date_created       + - Дата создания
    // date_deadline      + - Срок подписания   
	// employee           + - Сотрудник (структура)
	//      user_id       + - ID сотрудника
	//      user_individual_id + - Идентификатор физического лица
    // initiator:         + - Инициатор документа - структура
    //      id:           + - Идентификатор сотрудника
    //      individual_id + - Идентификатор физического лица
    //      name          + - Фамилия и имя сотрудника
    // file_path          + - Путь до файла документа
	// approvals          + - Подписанты (массив)
    //      approval_id   + - Идентификатор подписанта в маршруте
    //      user_id       + - Идентификатор сотрудника
    //      user_individual_id + - Идентификатор физического лица
    //      user_name     + - Фамилия и имя сотрудника
    //      status        + - Статус подписания
    //      date_sign     + - Дата подписания     	
		
	// Возвращаем: если все нормально определилось - IDДокументаМК, иначе- Неопределено. 
	мВозврат = Неопределено;
	мОшибка = Ложь;          
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСтрока = Новый Структура("Сотрудник, Организация, МК_КодДокумента, ДатаСоздания,
				              | НазваниеДокумента,НомерДокумента,ТипДокументаМК,СтатусДокумента,					
							  | КрайнийСрокПодписания, Инициатор, ПутьКФайлу, Подписанты, ДокСсылка1С");
	//Временно попробую определять сотрудника по ID именно сотрудника, потому что ID организаций пока не прилетают.
	
	//Если мЭлемент.Свойство("employee") Тогда   
	//	мЕмпл = мЭлемент.employee;
	//	Если Не (мЕмпл.user_id = Неопределено) Тогда
	//		мСтрока.Сотрудник = ОО.НайтиСотрудника(мЕмпл.user_id);   
	//		Если мСтрока.Сотрудник = Неопределено Тогда
	//			мОшибка = Истина;
	//		КонецЕсли
	//	Иначе	
	//		мОшибка = Истина;
	//	КонецЕсли;		
	//Иначе          
	//	мОшибка = Истина;
	//КонецЕсли;	
	//Если мОшибка = Ложь Тогда //  И мЭлемент.Свойство("division_id") Тогда
		//Если Не (мЭлемент.division_id = Неопределено) Тогда
		//	мСтрока.Организация = НайтиОрганизацию(мЭлемент.division_id);   
		//	Если мСтрока.Организация = Справочники.Организации.ПустаяСсылка() Тогда
		//		мОшибка = Истина;
		//	КонецЕсли;
		//Иначе	                 
		//	мОшибка = Истина;
		//КонецЕсли;
	//	мСтрока.Организация = мСтрока.Сотрудник.ГоловнаяОрганизация;  // Пока не смотрим на организацию из МК.
	//Иначе                
	//	мОшибка = Истина;
	//КонецЕсли;	     
	
	// Сотрудника теперь определяем по новым правилам: у нас есть ID физлица и ID организации. По ним надо найти сотрудника
	// Поэтому сначала определим организацию:      	
	
	Если мЭлемент.Свойство("division_id") Тогда
		Если Не (мЭлемент.division_id = Неопределено) И НЕ ПустаяСтрока(мЭлемент.division_id) Тогда			
			мСтрока.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(мЭлемент.division_id)); 
			Если мСтрока.Организация = Справочники.Организации.ПустаяСсылка() Тогда
				мОшибка = Истина;
			КонецЕсли;
		Иначе	                 
			мОшибка = Истина;
		КонецЕсли;		
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                                            

	Если мОшибка = Ложь И мЭлемент.Свойство("employee") Тогда   
		мЕмпл = мЭлемент.employee;
		Если Не (мЕмпл.user_individual_id = Неопределено) И НЕ ПустаяСтрока(мЕмпл.user_individual_id) Тогда
			мФЛ = ОО.НайтиФЛ(мЕмпл.user_individual_id);   
			Если мФЛ = Неопределено Тогда
				мОшибка = Истина;
			Иначе
				мСотр = Неопределено;
				мСписСотр = ОО.СписокСотрудниковПоФизлицу(мСтрока.Организация,мФЛ);  // В этой функции подбираются только основные сотрудники или внешние
				Если мСписСотр.Следующий() Тогда                                     // совместители. Если все хорошо, вернется одна запись. Если больше - нас не волнует,
					мСотр = мСписСотр.СотрудникСсылка;                               // возьмем первого.
				КонецЕсли;		
				Если мСотр = Неопределено Тогда
					мОшибка = Истина;
				Иначе     
					мСтрока.Сотрудник = мСотр; 
				КонецЕсли;	
			КонецЕсли
		Иначе	
			мОшибка = Истина;
		КонецЕсли;		
	Иначе          
		мОшибка = Истина;
	КонецЕсли;	   
	                           
	Если мОшибка = Ложь И мЭлемент.Свойство("document_id") Тогда
		мСтрока.МК_КодДокумента = мЭлемент.document_id; 
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	   
	Если мОшибка = Ложь И мЭлемент.Свойство("number") Тогда
		мСтрока.НомерДокумента = мЭлемент.number; 
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	 
	Если мОшибка = Ложь И мЭлемент.Свойство("name") Тогда
		мСтрока.НазваниеДокумента = мЭлемент.name; 
	Иначе                
		мОшибка = Истина;
	КонецЕсли;                                           
	Если мОшибка = Ложь И мЭлемент.Свойство("ext_id") Тогда
		мСтрока.ДокСсылка1С = мЭлемент.ext_id; 
	Иначе                
		мОшибка = Истина;
	КонецЕсли;                                           	
	Если мОшибка = Ложь И мЭлемент.Свойство("type_id") Тогда		
		мСтрока.ТипДокументаМК = Справочники.МК_ВидыДокументовМояКоманда.НайтиПоРеквизиту("ID", Строка(мЭлемент.type_id));
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	
	Если мОшибка = Ложь И мЭлемент.Свойство("status") Тогда
		мСтрока.СтатусДокумента = ПереводСтатусов(мЭлемент.status); 
		Если мСтрока.СтатусДокумента = Неопределено Тогда
			мОшибка = Истина;
		КонецЕсли;	
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	

	Если мОшибка = Ложь И мЭлемент.Свойство("date_created") Тогда
		мСтрока.ДатаСоздания = мДата1(мЭлемент.date_created);
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                                             
	
	Если мОшибка = Ложь И мЭлемент.Свойство("date_deadline") Тогда
		мСтрока.КрайнийСрокПодписания = мДата(мЭлемент.date_deadline);
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                                             
	
	Если мОшибка = Ложь И мЭлемент.Свойство("initiator") Тогда   
		// Сначала поищем инициатора как сотрудника? Наверное хватит и физлица.  
		мФИО = Неопределено;
		мИни = мЭлемент.initiator;
		Если Не (мИни.user_individual_id = Неопределено) И НЕ ПустаяСтрока(мИни.user_individual_id) Тогда   
			мФЛ = ОО.НайтиФЛ(мИни.user_individual_id); 
			Если НЕ мФЛ = Неопределено Тогда
				мФИО = мФЛ.Фамилия + " " + мФЛ.Инициалы; 
			КонецЕсли;	                               
		КонецЕсли;
		Если мФИО = Неопределено Тогда
			// Физлицо не найдено. Нужно достать ФИО из другого массива.						
			мФИО = "[" + мИни.name + "]";    
		КонецЕсли;
		мСтрока.Инициатор = мФИО;
	Иначе                
		мОшибка = Истина;
	КонецЕсли; 
	Если мОшибка = Ложь И мЭлемент.Свойство("file_path") Тогда
		мСтрока.ПутьКФайлу = мЭлемент.file_path;	
	КонецЕсли;
		
	Если мОшибка = Ложь И мЭлемент.Свойство("approvals") Тогда  
		мСписок = мЭлемент.approvals;
		мСтрока.Подписанты = Новый Массив;
		Для Каждого мПодписант Из мСписок Цикл
			мНовый = Новый Структура("Номер, Имя, ТипПодписи, Статус, ТекущийПодписант, ДатаПодписания, Физлицо");
			мНовый.Номер = мПодписант.approval_id;
			мНовый.Имя = мПодписант.user_name;			
			мНовый.ТипПодписи = мПодписант.type_signature; 
			//мНовый.СоставРоли = мПодписант.user_ids;
			мНовый.Статус = мПодписант.status;    
			мНовый.ТекущийПодписант = мПодписант.pointer;  
			мНовый.ДатаПодписания = мДата1(мПодписант.date_sign);
			мНовый.Физлицо = мПодписант.user_individual_id;
			мСтрока.Подписанты.Добавить(мНовый);
		КонецЦикла;	
	Иначе                
		мОшибка = Истина;
	КонецЕсли;  

	
	Если мОшибка = Ложь  Тогда    // Все определилось хорошо
		// Теперь - записать документ в справочник.
		мВозврат = ЗаписатьДокумент(мСтрока,1,Неопределено);  
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

Функция ЗаписатьДокумент(мДокумент, мРежим, мЗ)  Экспорт    // мРежим: 1 - массовое получение заявлений, 2 - обработка ответа по изменяемому заявлению
	мВозврат = Новый Структура("КодМК, Ссылка, Новый");
	мНовый = Ложь;
	мРез = Неопределено;
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  	
	Если мРежим = 1 Тогда 	     
		мСсылка = Неопределено;   
		// Прилетает такая структура : +Сотрудник, +Организация, +МК_КодДокумента, +ДатаСоздания,
		//		              | +НазваниеДокумента,+НомерДокумента,+ТипДокументаМК,+СтатусДокумента,					
		//					  | +КрайнийСрокПодписания, +Инициатор, +ПутьКФайлу, Подписанты, ДокСсылка1С");
		Если Не (мДокумент.ДокСсылка1С = Неопределено) Тогда
			мСсылка = Справочники.МК_ДокументыКЭДО.ПолучитьСсылку(Новый УникальныйИдентификатор(мДокумент.ДокСсылка1С)); 
		КонецЕсли;	

		Если мСсылка = Неопределено ИЛИ мСсылка.Пустая() Или мСсылка.ПометкаУдаления = Истина ИЛИ СтрНачинаетсяС(Строка(мСсылка),"<Объект не найден>")  Тогда   //  Не нашли, можно добавлять
			НовыйЭлемент = Справочники.МК_ДокументыКЭДО.СоздатьЭлемент(); 
			мСсылка = НовыйЭлемент.Ссылка;
			мНовый = Истина;  
			мВозврат.Новый = Истина;
		Иначе        
			НовыйЭлемент = мСсылка.ПолучитьОбъект();
			мВозврат.Новый = Ложь;
		КонецЕсли;			     
		мВозврат.КодМК = мДокумент.МК_КодДокумента;	
		
		НовыйЭлемент.Сотрудник = мДокумент.Сотрудник;  
		НовыйЭлемент.ОрганизацияСсылка = мДокумент.Организация;      
		НовыйЭлемент.МК_КодДокумента = мДокумент.МК_КодДокумента;
		НовыйЭлемент.ТипДокументаМК = мДокумент.ТипДокументаМК;
		НовыйЭлемент.ДатаДокумента = мДокумент.ДатаСоздания; 	
		НовыйЭлемент.Инициатор = мДокумент.Инициатор;
		НовыйЭлемент.ПутьДоФайлаДокумента = мДокумент.ПутьКФайлу;  
		НовыйЭлемент.СтатусДокумента = мДокумент.СтатусДокумента;       
		НовыйЭлемент.Наименование = мДокумент.НазваниеДокумента;  
		НовыйЭлемент.НомерДокумента = мДокумент.НомерДокумента;   
		НовыйЭлемент.КрайнийСрокПодписания = мДокумент.КрайнийСрокПодписания;
		
	Иначе     
		//НовыйЭлемент = мЗ.ПолучитьОбъект();                       
		//НовыйЭлемент.СтатусЗаявления = мЗаявление.СтатусЗаявления;
	КонецЕсли;	
		Если не мНовый Тогда  // Очистим табличную часть
			НовыйЭлемент.Подписанты.Очистить();				
		КонецЕсли;	                                          
		// Структура подписанта: "Номер, Имя, ТипПодписи, Статус, ТекущийПодписант, ДатаПодписания, Физлицо"
		Для Каждого мПодписант Из мДокумент.Подписанты Цикл
			мНоваяСтрока = НовыйЭлемент.Подписанты.Добавить();			
			мНоваяСтрока.Номер = мПодписант.Номер;            
			мФИО = Неопределено;
			мФЛ = ОО.НайтиФЛ(мПодписант.Физлицо); 
			Если НЕ (мФЛ = Неопределено) Тогда
				мФИО = мФЛ.Фамилия + " " + мФЛ.Инициалы; 
			Иначе
				мФио = "[" + мПодписант.Имя + "]";  
			КонецЕсли;	                      
			мНоваяСтрока.Имя = мФИО;
			Если мПодписант.ТекущийПодписант Тогда
				НовыйЭлемент.ОчередьПодписания = мФИО;            
				НовыйЭлемент.ТекущийПодписант = мФЛ;   
			КонецЕсли;			            
					
			Если мПодписант.ТипПодписи = "qes" Тогда
				мНоваяСтрока.ТипПодписи = "УКЭП";
			ИначеЕсли мПодписант.ТипПодписи = "nqes" Тогда
				мНоваяСтрока.ТипПодписи = "УНЭП";	
			ИначеЕсли мПодписант.ТипПодписи = "none" Тогда
				мНоваяСтрока.ТипПодписи = "Без подписи";
			КонецЕсли;	
			мНоваяСтрока.Статус = ПолучитьСтатусПодписанияДокумента(мПодписант.Статус);			
			мНоваяСтрока.ТекущийПодписант = мПодписант.ТекущийПодписант;
			мНоваяСтрока.ДатаПодписания = мПодписант.ДатаПодписания;
		КонецЦикла;
		Если НовыйЭлемент.ОчередьПодписания = "" Тогда // Это значит, что уже нет действующих подписантов, все завершилось. Ставят задачу показать последнего 
			Если НовыйЭлемент.Подписанты.Количество() > 0 Тогда
				мИндекс = НовыйЭлемент.Подписанты.Количество() - 1;
				мПоследний = НовыйЭлемент.Подписанты[мИндекс];
				НовыйЭлемент.ОчередьПодписания = мПоследний.Имя;
			КонецЕсли;
		КонецЕсли;	

		Попытка
			НовыйЭлемент.Записать(); 
			мВозврат.Ссылка = НовыйЭлемент.Ссылка;
		Исключение    		
			
		КонецПопытки;	               
	Возврат мВозврат;
КонецФункции	    


Функция мДата(мСтрока) 
	мСтр = СтроковыеФункцииКлиентСервер.СтрокаВДату(мСтрока, "ДФ='Д.М.Г'");
	Возврат Дата(мСтр);
КонецФункции

Функция мДата1(мСтрока) 
	//мСтр = СтроковыеФункцииКлиентСервер.СтрокаВДату(мСтрока, "ДФ='Д.М.Г Ч:М:C'"); // Не работает с временем.
	// Сначала надо найти часы и проверить: если два символа, хорошо. Иначе добавить ведущий ноль
	// Найдем первый пробел  
	мСтр1 = Неопределено;
	Если Не (мСтрока = Неопределено) Тогда
		мИндекс = СтрНайти(мСтрока, " "); // строки индексируются с единицы
		мИндекс1 = СтрНайти(мСтрока,":");
		мЧасы = Сред(мСтрока, мИндекс+1, мИндекс1- (мИндекс+1));
		Если СтрДлина(мЧасы)= 1 Тогда
			мЧасы = "0"+мЧасы;
		КонецЕсли;	
		мСтр1 = Лев(мСтрока,мИндекс-1)+ мЧасы + Прав(мСтрока, СтрДлина(мСтрока) - мИндекс1);
		мСтр1 = СтрЗаменить(мСтр1,"-","");  
		мСтр1 = СтрЗаменить(мСтр1,".","");
		мСтр1 = СтрЗаменить(мСтр1,":","");
		мСтр1 =  Дата(мСтр1);
	КонецЕсли;	
	Возврат мСтр1;
КонецФункции


Функция ПолучитьИмяФайла(мПутьКФайлу)  Экспорт     	
	// Из МК приходит полное имя с указанием сервера и т.д. А мне нужно имя начиная с "/storage/edms/documents/" и т.д.
	// Поэтому нужно откусить начало. 
	мДлина = СтрДлина(мПутьКФайлу);
	мИндекс = СтрНайти(мПутьКФайлу, "/storage/edms/documents/"); 
	Возврат Прав(мПутьКФайлу, мДлина - мИндекс+1);
КонецФункции  


&НаСервере
Процедура ОтразитьВРегистре(мСсылкаДокОсн,мСсылкаДокКЭДО,МК_Код,мСтатус,мКодСтатуса) Экспорт
	Если ЗначениеЗаполнено(мСсылкаДокОсн) Тогда
		НаборЗаписей = РегистрыСведений.МК_СостояниеДокументовКЭДО.СоздатьМенеджерЗаписи(); 
		НаборЗаписей.СсылкаНаДокумент = мСсылкаДокОсн;  
		НаборЗаписей.Прочитать();
		Если Не НаборЗаписей.Выбран() Тогда  
			НаборЗаписей.СсылкаНаДокумент = мСсылкаДокОсн; 
		КонецЕсли;	
		Если МК_Код = "195" Тогда       // 195 - код трудового договора
    		НаборЗаписей.СсылкаНаДоговор = мСсылкаДокКЭДО; 
			НаборЗаписей.СтатусДоговора = мСтатус;
			НаборЗаписей.КодСтатуса1 = мКодСтатуса;
		Иначе       	
			НаборЗаписей.СсылкаНаПриказ = мСсылкаДокКЭДО; 
	   		НаборЗаписей.СтатусПриказа = мСтатус;
	   		НаборЗаписей.КодСтатуса2 = мКодСтатуса;		
		КонецЕсли;   	
		НаборЗаписей.Записать();   
	КонецЕсли;	
КонецПроцедуры	

Процедура СоздатьЗаписиРегистраДокКЭДО() Экспорт
	Выборка = Справочники.МК_ДокументыКЭДО.Выбрать(); 
	Пока Выборка.Следующий() Цикл;                                                                          
		мСт = ОпределитьСтатус(Выборка.Ссылка);
		// В справочник тоже надо записать
		ОтразитьВРегистре(Выборка.ДокументОснование,Выборка.Ссылка,Выборка.КодТипаДокумента,мСт[0],мСт[1]); 
	КонецЦикла;	                  
КонецПроцедуры	     

Процедура ОтразитьСостояниеЗаписиВРегистре(мСсылка) Экспорт	
	//мДок = мСсылка.ПолучитьОбъект();    
	мСт = ОпределитьСтатус(мСсылка);
	ОтразитьВРегистре(мСсылка.ДокументОснование,мСсылка,мСсылка.КодТипаДокумента,мСт[0],мСт[1]);	
КонецПроцедуры

Функция ОпределитьСтатус(мДокКЭДО)  Экспорт 
	мСт = Новый Массив;
	Если мДокКЭДО.Отправлен Тогда
		Если мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С1 Тогда  // Черновик			
			//Если Не ЗначениеЗаполнено(мДокКЭДО.ИмяФайлаПодписи) Тогда  // Черновик не может быть подписан
				мСтатус = "Отправлен как черновик";   
				мКодСтатуса = 3;
			//КонецЕсли;	
		ИначеЕсли мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С2 Тогда
			//Если Не ЗначениеЗаполнено(мДокКЭДО.ИмяФайлаПодписи) ТОгда				
				мСтатус = "На подписании";                
				мКодСтатуса = 4;
			//КонецЕсли;
		ИначеЕсли мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С3 Тогда
			мСтатус = "Просрочен";                
			мКодСтатуса = 5;
		ИначеЕсли мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С4 Тогда
			мСтатус = "Выполнен";                
			мКодСтатуса = 7;  
		ИначеЕсли мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С5 Тогда
			мСтатус = "Отклонен";                
			мКодСтатуса = 6;
	    ИначеЕсли мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С6 Тогда
			мСтатус = "Недействителен";                
			мКодСтатуса = 8;  	
		КонецЕсли;
	Иначе   
		Если мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С6 Тогда
			мСтатус = "Недействителен";                
			мКодСтатуса = 8; 
		ИначеЕсли Не ЗначениеЗаполнено(мДокКЭДО.ИмяФайлаПодписи) ТОгда
			мСтатус = "Не отправлен";
			мКодСтатуса = 1;
		Иначе	                     
			мСтатус = "Подписан, не отправлен";
			мКодСтатуса = 2;
		КонецЕсли;
	КонецЕсли;	
	мСт.Добавить(мСтатус);
	мСт.Добавить(мКодСтатуса);
	Возврат мСт;
КонецФункции	    	

&НаСервере
Функция ЗапросСтатусовДокументовКЭДО(мСписДок)       Экспорт                      
	// Если отправить пустрой массив, вернется все, что изменилось с прошлого раза
	// Если список конкретных документов - то статусы по ним.
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мВозврат = Новый Массив; 
	мТело = Новый Структура;       	
	мТело.Вставить("Ids",мСписДок);
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мТело);	
		ТекстJSON = ЗаписьJSON.Закрыть();   	
		
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/documents-statuses", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				мВозврат = СтрОтвет.Data.Items;	
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
			Сообщить(мОшибка);
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

&НаСервере
Функция ЗапросСпискаДокументовКЭДО(мСписДок)       Экспорт                      
	// Если отправить пустрой массив, вернется все, что изменилось с прошлого раза
	// Если список конкретных документов - то статусы по ним.
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мВозврат = Новый Массив; 
	мТело = Новый Структура;       	
	мТело.Вставить("Ids",мСписДок);
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мТело);	
		ТекстJSON = ЗаписьJSON.Закрыть();   	
		
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/documents-statuses", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				мВозврат = СтрОтвет.Data.Items;	
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
			Сообщить(мОшибка);
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции


Функция ПолучитьСписокНезавершенных() Экспорт
	мВозврат = Новый Массив;
	Выборка = Справочники.МК_ДокументыКЭДО.Выбрать();
	Пока Выборка.Следующий() Цикл  
		//Если Выборка.Отправлен И НЕ (Выборка.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С6 ИЛИ
		Если НЕ (Выборка.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С6 ИЛИ
				 Выборка.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С5 ИЛИ 
			  	Выборка.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С4) Тогда
			мВозврат.Добавить(СокрЛП(Выборка.Ссылка.УникальныйИдентификатор()));
		КонецЕсли;
	КонецЦикла;	                                                                
	Возврат мВозврат;
КонецФункции	

Функция ЗаполнитьСтатусы(мСпис) Экспорт
	мКолво = 0;
	Для Каждого мЭлемент Из мСпис Цикл
		мКод = Строка(мЭлемент.ID);
		мДокСсылка = Справочники.МК_ДокументыКЭДО.ПолучитьСсылку(Новый УникальныйИдентификатор(мКод)); 
		Если Не мДокСсылка.Пустая() Тогда   
			мДок = мДокСсылка.ПолучитьОбъект();   
			мСтатус = ПереводСтатусов(мЭлемент.status);
			Если мСтатус <> Неопределено Тогда
				Если мДок.СтатусДокумента <> мСтатус Тогда
					мДок.СтатусДокумента = мСтатус;
					мДок.Записать();   
					мСтатусМассив = Справочники.МК_ДокументыКЭДО.ОпределитьСтатус(мДокСсылка); //   0 элемент - строка, 1 - число.
					мДок.СтатусЧислом = мСтатусМассив[1];
					мДок.Записать();    
					Справочники.МК_ДокументыКЭДО.ОтразитьВРегистре(мДок.ДокументОснование,мДокСсылка,мДок.КодТипаДокумента,мДок.СтатусДокумента,мДок.СтатусЧислом);
				КонецЕсли;	
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;		
	Возврат мКолво;   
КонецФункции    

Функция ПереводСтатусов(мКод)  // Тут перевод из выражений МК в перечисления 1С
	мВозврат = Неопределено;
	Если мКод = "draft" Тогда
		мВозврат = Перечисления.МК_СтатусыДокументов.С1
	ИначеЕсли мКод = "signing" Тогда
		мВозврат = Перечисления.МК_СтатусыДокументов.С2
	ИначеЕсли мКод = "expired" Тогда
		мВозврат = Перечисления.МК_СтатусыДокументов.С3	
	ИначеЕсли мКод = "completed" Тогда
		мВозврат = Перечисления.МК_СтатусыДокументов.С4	
	ИначеЕсли мКод = "rejected" Тогда
		мВозврат = Перечисления.МК_СтатусыДокументов.С5
	ИначеЕсли мКод = "invalid" Тогда
		мВозврат = Перечисления.МК_СтатусыДокументов.С6	
	КонецЕсли;
	Возврат мВозврат;     
КонецФункции	

Функция ПолучитьСтатусПодписанияДокумента(мКод) Экспорт
	мВозврат = Неопределено;
	Если мКод = "signing" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписанияДокументов.НаПодписании;
	ИначеЕсли мКод = "completed" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписанияДокументов.Подписан;
	ИначеЕсли мКод = "rejected" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписанияДокументов.Отклонен;		
	ИначеЕсли мКод = "waiting" Тогда
		мВозврат = Перечисления.МК_СтатусыПодписанияДокументов.ВОжидании;		
	КонецЕсли;
	Возврат мВозврат;
КонецФункции	   


//Функция ОтправитьНеотправленныеДокументыКЭДО()  Экспорт
	// Тут сначала нужно выбрать неотправленные документы.
	//Отбор = Новый Структура("Отправлен",Ложь);       
	//мДокс = Справочники.МК_ДокументыКЭДО.Выбрать(,,Отбор).;
//	мДокс = ВыбратьНеотправленныеДокументы();
//	Для Каждого мДок ИЗ мДокс Цикл
//		мРез = МК_ОтправитьДокумент(мДок.Ссылка);
//	КонецЦикла;		
//КонецФункции	                            

//Функция ВыбратьНеотправленныеДокументы()   
//	мЗапрос = Новый Запрос;
//	мЗапрос.Текст = "ВЫБРАТЬ
//     	|	МК_Док.Ссылка КАК Ссылка
//     	|ИЗ
//	   	|	Справочник.МК_ДокументыКЭДО КАК МК_Док
//		|ГДЕ
//		|	НЕ (МК_Док.Отправлен)      		
//		|   И НЕ МК_Док.ПометкаУдаления";
//	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
//	Выборка = РезультатЗапроса[0].Выгрузить();
//	Возврат Выборка;                     
//КонецФункции	

//Функция мК_ОтправитьДокумент(мДок)   
//	мВозврат = 1;
//	мФайлы = Новый Массив;       	
//	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(мДок, мФайлы);    
//	Если мФайлы.Количество()>0 Тогда
//		ИмяАрхива = мФайлы[0];
//	КонецЕсли;		
//	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
//	// Тут - отправка. 
//	мСеанс = ОО.СоздатьСеансСвязи(Истина);
//	Если мСеанс = Неопределено Тогда
//		// Ошибка авторизации. Ничего не отправляем. 
//		мВозврат = 4;		
//	Иначе
//		мРезультат = ОО.ВыгрузитьФайлНаСайт(ИмяАрхива,мСеанс,"pdf",Истина,"api/1c-exchange/edms/documents/upload","Документы КЭДО");
//		Если НЕ мРезультат Тогда
//			мВозврат = 5      // Ошибка отправки файла 
//		КонецЕсли;		
//  КонецЕсли;	
//	Если мВозврат = 1 Тогда   // Все удалось. Нужно отправить json описание файла.
//		мДокументы = Новый Массив;
//		мДокументы.Добавить(мДок);
//		мРезультат = МК_ОтправитьJSON(мДокументы);
//		Если НЕ мРезультат Тогда
//			мВозврат=7; //  Ошибка отправки описания файла.  
//		Иначе
//			ОтразитьСостояниеЗаписиВРегистре(мДок)
//		КонецЕсли;	
//	КонецЕсли;     
//КонецФункции

Функция МК_ОтправитьJSON(мДокументы)     Экспорт      // Отправлять будем сведения из добавленного элемента справочника "МК_ДокументыКЭДО"   
	мРезультат = Истина;
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	мСеанс = ОО.СоздатьСеансСвязи(Истина);
	Если мСеанс = Неопределено Тогда
		// Надо сообщить, что отправка не удалась.  
		Возврат Ложь;
	Иначе	
		Выгрузка = Новый Структура; 
		Выгрузка.Вставить("Documents",Новый Массив);		
		Для Каждого мСсылка из мДокументы Цикл    
			//УниверсальноеВремя(ТекущаяДатаСеанса(), ) 
			мДокКЭДО = мСсылка.ПолучитьОбъект();
			мОписание = Новый Структура;
			мОписание.Вставить("doc_id",СокрЛП(мСсылка.УникальныйИдентификатор()));
			мОписание.Вставить("doctype_id", мДокКЭДО.КодТипаДокумента); 
			мОписание.Вставить("doc_date", СокрЛП(мДокКЭДО.ДатаДокумента));
			мОписание.Вставить("company",СокрЛП(мДокКЭДО.ОрганизацияСсылка.УникальныйИдентификатор()));
			мОписание.Вставить("doc_number",СокрЛП(мДокКЭДО.НомерДокумента));
			//мОписание.Вставить("doc_date",Формат(мДокКЭДО.ДатаДокумента,"ДЛФ=D"));
			мОписание.Вставить("route",ОО.МК_ТипМаршрута(мДокКЭДО.МаршрутПодписания,1));
			мОписание.Вставить("deadline",Формат(мДокКЭДО.КрайнийСрокПодписания,"ДЛФ=D")); 
			мОписание.Вставить("head",СокрЛП(мДокКЭДО.Руководитель.УникальныйИдентификатор()));  
			мОписание.Вставить("head_individual",СокрЛП(мДокКЭДО.РуководительФЛ.УникальныйИдентификатор()));  
			мОписание.Вставить("filename",СокрЛП(мДокКЭДО.ИмяФайлаДокумента)); 
			Если ЗначениеЗаполнено(мДокКЭДО.ИмяФайлаПодписи) Тогда
				мОписание.Вставить("signature",СокрЛП(мДокКЭДО.ИмяФайлаПодписи)); 
				мОписание.Вставить("signature_date",СокрЛП(мДокКЭДО.ДатаПодписи)); 
				мОписание.Вставить("signature_owner",СокрЛП(мДокКЭДО.ВладелецЭЦП.УникальныйИдентификатор()));
			КонецЕсли;	

			мЧерновик = Ложь;
			Если мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С1 Тогда   
				мЧерновик = Истина;
			КонецЕсли;	
			мОписание.Вставить("draft", мЧерновик);
			// Тут надо добавить сотрудников   
			мСписСотр = Новый Массив;
			Для Каждого мСотр ИЗ мДокКЭДО.СотрудникиДокумента Цикл     
				// 10.02.2025 Меняем в выгрузке документа сотрудника на физлицо
				//мСписСотр.Добавить(СокрЛП(мСотр.СотрудникСсылка.УникальныйИдентификатор()));
				мСписСотр.Добавить(СокрЛП(мСотр.СотрудникСсылка.ФизическоеЛицо.УникальныйИдентификатор()));
			КонецЦикла;	                                
			мОписание.Вставить("employees",мСписСотр);
			Выгрузка.Documents.Добавить(мОписание);
		КонецЦикла;
	КонецЕсли;	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
			
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();
	Исключение
		Сообщить(ЗначениеВСтрокуВнутр(Выгрузка));
		ВызватьИсключение(ОписаниеОшибки());
	КонецПопытки;
			
	hЗапрос = ОО.СоздатьHTTPЗапрос("api/1c-exchange/edms/documents", мСеанс);
	hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);   
	hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
	hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);
	мОтвет = ОО.ПроверитьОтвет(hОтвет,"Документы КЭДО",Истина); 
	Если мОтвет Тогда   // Если отправка случилась успешно, запишем, что документы отправлены.   
		Для Каждого мСсылка из мДокументы Цикл
			мДокКЭДО = мСсылка.ПолучитьОбъект();
			мДокКэдо.Отправлен = Истина;    
			// Статус поменять!!!   
			Если мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С1 Тогда;  // Черновик 
				мДокКЭДО.СтатусЧислом = 3;
			Иначе	                      
				мДокКЭДО.СтатусЧислом = 4;
			КонецЕсли;	
			мДокКэдо.Записать();
		КонецЦикла;	
	КонецЕсли;
	Возврат мОтвет;
КонецФункции	            


&НаСервере
Функция ОтправитьСписокДокументов(мСписок)                      
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 	
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		
		мВыгрузка = Новый Структура;  
		мВыгрузка.Вставить("Document_Ids",мСписок);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мВыгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();   	  	                                          
		hЗапрос = ОО.СоздатьHTTPЗапрос("api/1c-exchange/edms/documents/mark-exported", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
			//	// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				мВозврат = СтрОтвет.Data.Status;	
			КонецЕсли;	
			мВозврат = СтрОтвет;
		Исключение   
			мОшибка = "Ошибка отправки списка записанных документов. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
			Сообщить(мОшибка);
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

&НаСервере
Функция ПолучитьСписокДелегатов(мНомерУчастника)      Экспорт    
	// GET /api/1c-exchange/edms/documents/delegate/users-list

	мУспех = Ложь;
	// 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина);                            
	мВозврат = Новый Структура("Результат,ТекстОшибки,Подписанты,НомерУчастника", Ложь);   
	
	//мСтр = Новый Структура("approval_id",мНомерУчастника);
	мЗапрос = "/api/1c-exchange/edms/documents/delegate/users-list?approval_id="+Строка(мНомерУчастника); 
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.		
		мОшибка = "Ошибка соединения";
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		hЗапрос = ОО.СоздатьHTTPЗапрос(мЗапрос, мСеанс);    		
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная    
				мОшибка = "Неверная структура ответа от МК";
			Иначе     	
				Если СтрОтвет.data.status = "success" Тогда 
					мВозврат.Результат = Истина;  
					мВозврат.Подписанты = СтрОтвет.data.users;                     
					мВозврат.НомерУчастника = мНомерУчастника;
				Иначе                                                
					мОшибка = "";
					Для Каждого тОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + тОшибка;
					КонецЦикла;	                                 
					мВозврат.ТекстОшибки = мОшибка;
				КонецЕсли;	 		
			КонецЕсли;	
		Исключение         
			мВозврат.Результат = Ложь;
			мОшибка = "Ошибка получения списка делегатов. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  		
		КонецПопытки; 						
	КонецЕсли;	 
	мВозврат.ТекстОшибки = мОшибка;
	Возврат мВозврат;
КонецФункции	


&НаСервере
Функция ОтправитьДелегата(мПарам)      Экспорт    
	// POST/api/1c-exchange/edms/documents/delegate
	мУспех = Ложь;     
	мОшибка = "";
	// 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина);                            
	мВозврат = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);   
	
	мСтр = Новый Структура("approval_id, user_id",Формат(мПарам.НомерУчастника, "ЧГ=0")  , Формат(мПарам.НомерДелегата, "ЧГ=0"));
	
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.		
		мОшибка = "Ошибка соединения";
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).  
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мСтр);	
		ТекстJSON = ЗаписьJSON.Закрыть();  	
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/documents/delegate", мСеанс);    		
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);   
		hЗапрос.Заголовки.Вставить("Content-Type","application/json");
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
				мОшибка = "Неверная структура ответа от МК";
			Иначе     					
				Если СтрОтвет.data.status = "success" Тогда 
					мВозврат.Результат = Истина;   
				Иначе                                                
					мОшибка = "";
					Для Каждого тОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + тОшибка;
					КонецЦикла;	                                 
				КонецЕсли;		   			
				мВозврат.Подписанты = СтрОтвет.data.document.approvals;
				мВозврат.Статус = СтрОтвет.data.document.status; 				
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения ответа на делегирование. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  		
		КонецПопытки; 						
	КонецЕсли;	    
	мВозврат.ТекстОшибки = мОшибка;
	Возврат мВозврат;
КонецФункции	

&НаСервере
Функция НапомнитьОПодписании(мПарам)      Экспорт 
	//POST /api/1c-exchange/edms/documents/remind	
	мУспех = Ложь;     
	мОшибка = "";
	// 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина);                            
	мВозврат = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);   
	
	мСтр = Новый Структура("approval_id",Формат(мПарам.НомерУчастника, "ЧГ=0"));
	
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.		
		мОшибка = "Ошибка соединения";
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).  
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мСтр);	
		ТекстJSON = ЗаписьJSON.Закрыть();  	
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/documents/remind", мСеанс);    		
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);    
		hЗапрос.Заголовки.Вставить("Content-Type","application/json");
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     					
				Если СтрОтвет.data.status = "success" Тогда 
					мВозврат.Результат = Истина;                                    				
				Иначе                                                
					мОшибка = "";
					Для Каждого тОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка +тОшибка;
					КонецЦикла	
				КонецЕсли;					                                        
				мВозврат.Статус = СтрОтвет.data.document.status;                
				мВозврат.Подписанты = СтрОтвет.data.document.approvals;			
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения ответа на напоминание. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  		
		КонецПопытки; 						
	КонецЕсли;	 
	мВозврат.ТекстОшибки = мОшибка;
	Возврат мВозврат;
КонецФункции	


&НаСервере
Функция УдалитьДокумент(мПарам)      Экспорт 
	//DELETE /api/1c-exchange/edms/documents/document_id	
	мУспех = Ложь;
	мОшибка = "";
	// 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина);                            
	мВозврат = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);   
	
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.		
		мОшибка = "Ошибка соединения";
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).  
		мЗапрос = "/api/1c-exchange/edms/documents/"+мПарам;	
		hЗапрос = ОО.СоздатьHTTPЗапрос(мЗапрос, мСеанс);    				
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("DELETE", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе    		    					
				Если СтрОтвет.data.status = "success" Тогда 
					мВозврат.Результат = Истина;   
				Иначе                                                
					мОшибка = "";
					Для Каждого тОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + мОшибка;
					КонецЦикла	
				КонецЕсли;					
				мВозврат.Подписанты = СтрОтвет.data.document.approvals;
				мВозврат.Статус = СтрОтвет.data.document.status;  			
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения ответа на удаление. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  		
		КонецПопытки; 						
	КонецЕсли;	 
	мВозврат.ТекстОшибки = мОшибка;
	Возврат мВозврат;
КонецФункции	

&НаСервере
Функция ОбновитьДокумент(мПарам)      Экспорт 
	// мПарам - структура: ДокСсылка, Статус, Подписанты
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мДок = мПарам.ДокСсылка.ПолучитьОбъект();   
	мДок.СтатусДокумента = ПереводСтатусов(мПарам.Статус);
	мДок.Подписанты.Очистить();				
		
	// Структура подписанта: "Номер, Имя, ТипПодписи, Статус, ТекущийПодписант, ДатаПодписания, Физлицо"      
	//      approval_id   + - Идентификатор подписанта в маршруте
    //      user_id       + - Идентификатор сотрудника
    //      user_individual_id + - Идентификатор физического лица
    //      user_name     + - Фамилия и имя сотрудника
    //      status        + - Статус подписания
    //      date_sign     + - Дата подписания 
	Для Каждого мПодписант Из мПарам.Подписанты Цикл
		мНоваяСтрока = мДок.Подписанты.Добавить();			
		мНоваяСтрока.Номер = мПодписант.approval_id;            
		мФИО = Неопределено;
		мФЛ = ОО.НайтиФЛ(мПодписант.user_individual_id); 
		Если НЕ (мФЛ = Неопределено) Тогда
			мФИО = мФЛ.Фамилия + " " + мФЛ.Инициалы; 
		Иначе
			мФио = "[" + мПодписант.user_name + "]";  
		КонецЕсли;	                      
		мНоваяСтрока.Имя = мФИО;
		Если мПодписант.pointer Тогда
			мДок.ОчередьПодписания = мФИО;            
			мДок.ТекущийПодписант = мФЛ;   
		КонецЕсли;			            
				
		Если мПодписант.type_signature = "qes" Тогда
			мНоваяСтрока.ТипПодписи = "УКЭП";
		ИначеЕсли мПодписант.type_signature = "nqes" Тогда
			мНоваяСтрока.ТипПодписи = "УНЭП";	
		ИначеЕсли мПодписант.type_signature = "none" Тогда
			мНоваяСтрока.ТипПодписи = "Без подписи";
		КонецЕсли;	
		мНоваяСтрока.Статус = ПолучитьСтатусПодписанияДокумента(мПодписант.status);			
		мНоваяСтрока.ТекущийПодписант = мПодписант.pointer;
		мНоваяСтрока.ДатаПодписания = мДата1(мПодписант.date_sign);
	КонецЦикла;
	Если мДок.ОчередьПодписания = "" Тогда // Это значит, что уже нет действующих подписантов, все завершилось. Ставят задачу показать последнего 
		Если мДок.Подписанты.Количество() > 0 Тогда
			мИндекс = мДок.Подписанты.Количество() - 1;
			мПоследний = мДок.Подписанты[мИндекс];
			мДок.ОчередьПодписания = мПоследний.Имя;
		КонецЕсли;
	КонецЕсли;	
	Попытка
		мДок.Записать(); 			
	Исключение 		
	КонецПопытки;
КонецФункции

&НаСервере
Функция ОтклонитьПодписание(мПарам)      Экспорт 
	//POST /api/1c-exchange/edms/documents/reject
	
	мУспех = Ложь;     
	мОшибка = "";
	// 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина);                            
	мВозврат = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);   
	
	мСтр = Новый Структура("approval_id, reason",Формат(мПарам.НомерУчастника, "ЧГ=0"), мПарам.Причина);
	
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.		
		мОшибка = "Ошибка соединения";
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).  
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мСтр);	
		ТекстJSON = ЗаписьJSON.Закрыть();  	
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/documents/reject", мСеанс);    		
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);    
		hЗапрос.Заголовки.Вставить("Content-Type","application/json");
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная    
				мОшибка = "Неверная структура ответа от МК";
			Иначе     					
				Если СтрОтвет.data.status = "success" Тогда 
					мВозврат.Результат = Истина;   
				Иначе                                                
					мОшибка = "";
					Для Каждого тОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + тОшибка;
					КонецЦикла	
				КонецЕсли;					
				мВозврат.Подписанты = СтрОтвет.data.document.approvals;
				мВозврат.Статус = СтрОтвет.data.document.status;  
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения ответа на отклонение. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  		
		КонецПопытки; 						
	КонецЕсли;	 
	мВозврат.ТекстОшибки = мОшибка;
	Возврат мВозврат;
КонецФункции	

&НаСервере
Функция ОтправитьПодпись(мПарам)      Экспорт 
	//POST /api/1c-exchange/edms/documents/sign 	
	мУспех = Ложь;     
	мОшибка = "";
	// 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина);                            
	мВозврат = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);   
	
	мСтрока = Base64Строка(мПарам.Подпись);
	мДата = УниверсальноеВремя(ТекущаяДатаСеанса(), ЧасовойПоясСеанса());
	мСтр = Новый Структура("approval_id, date_sign, file_sign",Формат(мПарам.НомерУчастника, "ЧГ=0"), мДата, мСтрока);
	
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.		
		мОшибка = "Ошибка соединения";
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).  
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мСтр);	
		ТекстJSON = ЗаписьJSON.Закрыть();  	
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/documents/sign", мСеанс);    		
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);    
		hЗапрос.Заголовки.Вставить("Content-Type","application/json");
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная   
				мОшибка = "Неверная структура ответа от МК";
			Иначе     					
				Если СтрОтвет.data.status = "success" Тогда 
					мВозврат.Результат = Истина;   
				Иначе                                                
					мОшибка = "";
					Для Каждого тОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + тОшибка;
					КонецЦикла	
				КонецЕсли;					
				мВозврат.Подписанты = СтрОтвет.data.document.approvals;
				мВозврат.Статус = СтрОтвет.data.document.status;  
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения ответа на отклонение. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  		
		КонецПопытки; 						
	КонецЕсли;	 
	мВозврат.ТекстОшибки = мОшибка;
	Возврат мВозврат;
КонецФункции	


#КонецЕсли
